title: Access to .onion Domains
id: 4c9d8e2e-6e72-4a1b-9f92-07e55d5e94a3
status: experimental
description: Detects attempts to access .onion domains through proxy, firewall, or DNS logs.
author: Ilyess Sellami
date: 2025-09-27
references:
    - https://attack.mitre.org/techniques/T1071/
tags:
    - attack.command_and_control
    - attack.tor
logsource:
    category: proxy
    product: any
detection:
    selection:
        url|contains: ".onion"
    condition: selection
level: high
