title: Dark Web Marketplace Access Attempt
id: f1325f13-627a-4f91-9c5d-34c47efc7d7a
status: experimental
description: Detects attempts to reach known dark web marketplace domains or related keywords in proxy or DNS logs.
author: Ilyess Sellami
date: 2025-09-27
references:
    - https://attack.mitre.org/techniques/T1071/
    - https://darkowl.com
    - https://www.europol.europa.eu
tags:
    - attack.exfiltration
    - attack.c2
logsource:
    category: proxy
    product: any
detection:
    selection:
        url|contains:
            - "silkroad"
            - "hydra"
            - "alphabay"
            - "dreammarket"
            - "darkmarket"
            - "wallstreet"
            - "whitehouse"
            - "valhalla"
            - "pandora"
            - "agora"
            - "hansa"
            - "versus"
            - "cartel"
            - "dark0de"
            - "weedo"
            - "cannazon"
            - "evolution"
            - "outlaw"
            - "berlusconi"
            - "cgmc"
            - "blackbank"
            - "darkfox"
            - "torrez"
            - "asapmarket"
            - "kingdom"
            - "connect"
            - "blackhand"
            - "cryptonia"
            - "nemesis"
            - "bohemia"
    condition: selection
level: high
