title: Tor Process Execution on Endpoint
id: 91aa798f-27f4-4c5f-baa4-8e7cc92eb6cb
status: experimental
description: Detects execution of Tor processes on endpoint devices.
author: Ilyess Sellami
date: 2025-09-27
references:
    - https://attack.mitre.org/techniques/T1090/
tags:
    - attack.defense_evasion
    - attack.tor
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - "tor.exe"
            - "torbrowser.exe"
    condition: selection
level: high
